Voghy/Micro1_Sist_hidro_Vert/ADC_SensordeAgua/Agua.cydsn/Generated_Source/PSoC5/UART_PSOC.h
/*******************************************************************************
* File Name: UART_PSOC.h
* Version 2.50
*
* Description:
*  Contains the function prototypes and constants available to the UART
*  user module.
*
* Note:
*
********************************************************************************
* Copyright 2008-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/


#if !defined(CY_UART_UART_PSOC_H)
#define CY_UART_UART_PSOC_H

#include "cyfitter.h"
#include "cytypes.h"
#include "CyLib.h" /* For CyEnterCriticalSection() and CyExitCriticalSection() functions */


/***************************************
* Conditional Compilation Parameters
***************************************/

#define UART_PSOC_RX_ENABLED                     (1u)
#define UART_PSOC_TX_ENABLED                     (1u)
#define UART_PSOC_HD_ENABLED                     (0u)
#define UART_PSOC_RX_INTERRUPT_ENABLED           (0u)
#define UART_PSOC_TX_INTERRUPT_ENABLED           (0u)
#define UART_PSOC_INTERNAL_CLOCK_USED            (1u)
#define UART_PSOC_RXHW_ADDRESS_ENABLED           (0u)
#define UART_PSOC_OVER_SAMPLE_COUNT              (8u)
#define UART_PSOC_PARITY_TYPE                    (0u)
#define UART_PSOC_PARITY_TYPE_SW                 (0u)
#define UART_PSOC_BREAK_DETECT                   (0u)
#define UART_PSOC_BREAK_BITS_TX                  (13u)
#define UART_PSOC_BREAK_BITS_RX                  (13u)
#define UART_PSOC_TXCLKGEN_DP                    (1u)
#define UART_PSOC_USE23POLLING                   (1u)
#define UART_PSOC_FLOW_CONTROL                   (0u)
#define UART_PSOC_CLK_FREQ                       (0u)
#define UART_PSOC_TX_BUFFER_SIZE                 (4u)
#define UART_PSOC_RX_BUFFER_SIZE                 (4u)

/* Check to see if required defines such as CY_PSOC5LP are available */
/* They are defined starting with cy_boot v3.0 */
#if !defined (CY_PSOC5LP)
    #error Component UART_v2_50 requires cy_boot v3.0 or later
#endif /* (CY_PSOC5LP) */

#if defined(UART_PSOC_BUART_sCR_SyncCtl_CtrlReg__CONTROL_REG)
    #define UART_PSOC_CONTROL_REG_REMOVED            (0u)
#else
    #define UART_PSOC_CONTROL_REG_REMOVED            (1u)
#endif /* End UART_PSOC_BUART_sCR_SyncCtl_CtrlReg__CONTROL_REG */


/***************************************
*      Data Structure Definition
***************************************/

/* Sleep Mode API Support */
typedef struct UART_PSOC_backupStruct_
{
    uint8 enableState;

    #if(UART_PSOC_CONTROL_REG_REMOVED == 0u)
        uint8 cr;
    #endif /* End UART_PSOC_CONTROL_REG_REMOVED */

} UART_PSOC_BACKUP_STRUCT;


/***************************************
*       Function Prototypes
***************************************/

void UART_PSOC_Start(void) ;
void UART_PSOC_Stop(void) ;
uint8 UART_PSOC_ReadControlRegister(void) ;
void UART_PSOC_WriteControlRegister(uint8 control) ;

void UART_PSOC_Init(void) ;
void UART_PSOC_Enable(void) ;
void UART_PSOC_SaveConfig(void) ;
void UART_PSOC_RestoreConfig(void) ;
void UART_PSOC_Sleep(void) ;
void UART_PSOC_Wakeup(void) ;

/* Only if RX is enabled */
#if( (UART_PSOC_RX_ENABLED) || (UART_PSOC_HD_ENABLED) )

    #if (UART_PSOC_RX_INTERRUPT_ENABLED)
        #define UART_PSOC_EnableRxInt()  CyIntEnable (UART_PSOC_RX_VECT_NUM)
        #define UART_PSOC_DisableRxInt() CyIntDisable(UART_PSOC_RX_VECT_NUM)
        CY_ISR_PROTO(UART_PSOC_RXISR);
    #endif /* UART_PSOC_RX_INTERRUPT_ENABLED */

    void UART_PSOC_SetRxAddressMode(uint8 addressMode)
                                                           ;
    void UART_PSOC_SetRxAddress1(uint8 address) ;
    void UART_PSOC_SetRxAddress2(uint8 address) ;

    void  UART_PSOC_SetRxInterruptMode(uint8 intSrc) ;
    uint8 UART_PSOC_ReadRxData(void) ;
    uint8 UART_PSOC_ReadRxStatus(void) ;
    uint8 UART_PSOC_GetChar(void) ;
    uint16 UART_PSOC_GetByte(void) ;
    uint8 UART_PSOC_GetRxBufferSize(void)
                                                            ;
    void UART_PSOC_ClearRxBuffer(void) ;

    /* Obsolete functions, defines for backward compatible */
    #define UART_PSOC_GetRxInterruptSource   UART_PSOC_ReadRxStatus

#endif /* End (UART_PSOC_RX_ENABLED) || (UART_PSOC_HD_ENABLED) */

/* Only if TX is enabled */
#if(UART_PSOC_TX_ENABLED || UART_PSOC_HD_ENABLED)

    #if(UART_PSOC_TX_INTERRUPT_ENABLED)
        #define UART_PSOC_EnableTxInt()  CyIntEnable (UART_PSOC_TX_VECT_NUM)
        #define UART_PSOC_DisableTxInt() CyIntDisable(UART_PSOC_TX_VECT_NUM)
        #define UART_PSOC_SetPendingTxInt() CyIntSetPending(UART_PSOC_TX_VECT_NUM)
        #define UART_PSOC_ClearPendingTxInt() CyIntClearPending(UART_PSOC_TX_VECT_NUM)
        CY_ISR_PROTO(UART_PSOC_TXISR);
    #endif /* UART_PSOC_TX_INTERRUPT_ENABLED */

    void UART_PSOC_SetTxInterruptMode(uint8 intSrc) ;
    void UART_PSOC_WriteTxData(uint8 txDataByte) ;
    uint8 UART_PSOC_ReadTxStatus(void) ;
    void UART_PSOC_PutChar(uint8 txDataByte) ;
    void UART_PSOC_PutString(const char8 string[]) ;
    void UART_PSOC_PutArray(const uint8 string[], uint8 byteCount)
                                                            ;
    void UART_PSOC_PutCRLF(uint8 txDataByte) ;
    void UART_PSOC_ClearTxBuffer(void) ;
    void UART_PSOC_SetTxAddressMode(uint8 addressMode) ;
    void UART_PSOC_SendBreak(uint8 retMode) ;
    uint8 UART_PSOC_GetTxBufferSize(void)
                                                            ;
    /* Obsolete functions, defines for backward compatible */
    #define UART_PSOC_PutStringConst         UART_PSOC_PutString
    #define UART_PSOC_PutArrayConst          UART_PSOC_PutArray
    #define UART_PSOC_GetTxInterruptSource   UART_PSOC_ReadTxStatus

#endif /* End UART_PSOC_TX_ENABLED || UART_PSOC_HD_ENABLED */

#if(UART_PSOC_HD_ENABLED)
    void UART_PSOC_LoadRxConfig(void) ;
    void UART_PSOC_LoadTxConfig(void) ;
#endif /* End UART_PSOC_HD_ENABLED */


/* Communication bootloader APIs */
#if defined(CYDEV_BOOTLOADER_IO_COMP) && ((CYDEV_BOOTLOADER_IO_COMP == CyBtldr_UART_PSOC) || \
                                          (CYDEV_BOOTLOADER_IO_COMP == CyBtldr_Custom_Interface))
    /* Physical layer functions */
    void    UART_PSOC_CyBtldrCommStart(void) CYSMALL ;
    void    UART_PSOC_CyBtldrCommStop(void) CYSMALL ;
    void    UART_PSOC_CyBtldrCommReset(void) CYSMALL ;
    cystatus UART_PSOC_CyBtldrCommWrite(const uint8 pData[], uint16 size, uint16 * count, uint8 timeOut) CYSMALL
             ;
    cystatus UART_PSOC_CyBtldrCommRead(uint8 pData[], uint16 size, uint16 * count, uint8 timeOut) CYSMALL
             ;

    #if (CYDEV_BOOTLOADER_IO_COMP == CyBtldr_UART_PSOC)
        #define CyBtldrCommStart    UART_PSOC_CyBtldrCommStart
        #define CyBtldrCommStop     UART_PSOC_CyBtldrCommStop
        #define CyBtldrCommReset    UART_PSOC_CyBtldrCommReset
        #define CyBtldrCommWrite    UART_PSOC_CyBtldrCommWrite
        #define CyBtldrCommRead     UART_PSOC_CyBtldrCommRead
    #endif  /* (CYDEV_BOOTLOADER_IO_COMP == CyBtldr_UART_PSOC) */

    /* Byte to Byte time out for detecting end of block data from host */
    #define UART_PSOC_BYTE2BYTE_TIME_OUT (25u)
    #define UART_PSOC_PACKET_EOP         (0x17u) /* End of packet defined by bootloader */
    #define UART_PSOC_WAIT_EOP_DELAY     (5u)    /* Additional 5ms to wait for End of packet */
    #define UART_PSOC_BL_CHK_DELAY_MS    (1u)    /* Time Out quantity equal 1mS */

