Voghy/Micro1_Sist_hidro_Vert/ADC_SensordeAgua/Agua.cydsn/Generated_Source/PSoC5/UART_PSOC.h
#endif /* CYDEV_BOOTLOADER_IO_COMP */


/***************************************
*          API Constants
***************************************/
/* Parameters for SetTxAddressMode API*/
#define UART_PSOC_SET_SPACE      (0x00u)
#define UART_PSOC_SET_MARK       (0x01u)

/* Status Register definitions */
#if( (UART_PSOC_TX_ENABLED) || (UART_PSOC_HD_ENABLED) )
    #if(UART_PSOC_TX_INTERRUPT_ENABLED)
        #define UART_PSOC_TX_VECT_NUM            (uint8)UART_PSOC_TXInternalInterrupt__INTC_NUMBER
        #define UART_PSOC_TX_PRIOR_NUM           (uint8)UART_PSOC_TXInternalInterrupt__INTC_PRIOR_NUM
    #endif /* UART_PSOC_TX_INTERRUPT_ENABLED */

    #define UART_PSOC_TX_STS_COMPLETE_SHIFT          (0x00u)
    #define UART_PSOC_TX_STS_FIFO_EMPTY_SHIFT        (0x01u)
    #define UART_PSOC_TX_STS_FIFO_NOT_FULL_SHIFT     (0x03u)
    #if(UART_PSOC_TX_ENABLED)
        #define UART_PSOC_TX_STS_FIFO_FULL_SHIFT     (0x02u)
    #else /* (UART_PSOC_HD_ENABLED) */
        #define UART_PSOC_TX_STS_FIFO_FULL_SHIFT     (0x05u)  /* Needs MD=0 */
    #endif /* (UART_PSOC_TX_ENABLED) */

    #define UART_PSOC_TX_STS_COMPLETE            (uint8)(0x01u << UART_PSOC_TX_STS_COMPLETE_SHIFT)
    #define UART_PSOC_TX_STS_FIFO_EMPTY          (uint8)(0x01u << UART_PSOC_TX_STS_FIFO_EMPTY_SHIFT)
    #define UART_PSOC_TX_STS_FIFO_FULL           (uint8)(0x01u << UART_PSOC_TX_STS_FIFO_FULL_SHIFT)
    #define UART_PSOC_TX_STS_FIFO_NOT_FULL       (uint8)(0x01u << UART_PSOC_TX_STS_FIFO_NOT_FULL_SHIFT)
#endif /* End (UART_PSOC_TX_ENABLED) || (UART_PSOC_HD_ENABLED)*/

#if( (UART_PSOC_RX_ENABLED) || (UART_PSOC_HD_ENABLED) )
    #if(UART_PSOC_RX_INTERRUPT_ENABLED)
        #define UART_PSOC_RX_VECT_NUM            (uint8)UART_PSOC_RXInternalInterrupt__INTC_NUMBER
        #define UART_PSOC_RX_PRIOR_NUM           (uint8)UART_PSOC_RXInternalInterrupt__INTC_PRIOR_NUM
    #endif /* UART_PSOC_RX_INTERRUPT_ENABLED */
    #define UART_PSOC_RX_STS_MRKSPC_SHIFT            (0x00u)
    #define UART_PSOC_RX_STS_BREAK_SHIFT             (0x01u)
    #define UART_PSOC_RX_STS_PAR_ERROR_SHIFT         (0x02u)
    #define UART_PSOC_RX_STS_STOP_ERROR_SHIFT        (0x03u)
    #define UART_PSOC_RX_STS_OVERRUN_SHIFT           (0x04u)
    #define UART_PSOC_RX_STS_FIFO_NOTEMPTY_SHIFT     (0x05u)
    #define UART_PSOC_RX_STS_ADDR_MATCH_SHIFT        (0x06u)
    #define UART_PSOC_RX_STS_SOFT_BUFF_OVER_SHIFT    (0x07u)

    #define UART_PSOC_RX_STS_MRKSPC           (uint8)(0x01u << UART_PSOC_RX_STS_MRKSPC_SHIFT)
    #define UART_PSOC_RX_STS_BREAK            (uint8)(0x01u << UART_PSOC_RX_STS_BREAK_SHIFT)
    #define UART_PSOC_RX_STS_PAR_ERROR        (uint8)(0x01u << UART_PSOC_RX_STS_PAR_ERROR_SHIFT)
    #define UART_PSOC_RX_STS_STOP_ERROR       (uint8)(0x01u << UART_PSOC_RX_STS_STOP_ERROR_SHIFT)
    #define UART_PSOC_RX_STS_OVERRUN          (uint8)(0x01u << UART_PSOC_RX_STS_OVERRUN_SHIFT)
    #define UART_PSOC_RX_STS_FIFO_NOTEMPTY    (uint8)(0x01u << UART_PSOC_RX_STS_FIFO_NOTEMPTY_SHIFT)
    #define UART_PSOC_RX_STS_ADDR_MATCH       (uint8)(0x01u << UART_PSOC_RX_STS_ADDR_MATCH_SHIFT)
    #define UART_PSOC_RX_STS_SOFT_BUFF_OVER   (uint8)(0x01u << UART_PSOC_RX_STS_SOFT_BUFF_OVER_SHIFT)
    #define UART_PSOC_RX_HW_MASK                     (0x7Fu)
#endif /* End (UART_PSOC_RX_ENABLED) || (UART_PSOC_HD_ENABLED) */

/* Control Register definitions */
#define UART_PSOC_CTRL_HD_SEND_SHIFT                 (0x00u) /* 1 enable TX part in Half Duplex mode */
#define UART_PSOC_CTRL_HD_SEND_BREAK_SHIFT           (0x01u) /* 1 send BREAK signal in Half Duplez mode */
#define UART_PSOC_CTRL_MARK_SHIFT                    (0x02u) /* 1 sets mark, 0 sets space */
#define UART_PSOC_CTRL_PARITY_TYPE0_SHIFT            (0x03u) /* Defines the type of parity implemented */
#define UART_PSOC_CTRL_PARITY_TYPE1_SHIFT            (0x04u) /* Defines the type of parity implemented */
#define UART_PSOC_CTRL_RXADDR_MODE0_SHIFT            (0x05u)
#define UART_PSOC_CTRL_RXADDR_MODE1_SHIFT            (0x06u)
#define UART_PSOC_CTRL_RXADDR_MODE2_SHIFT            (0x07u)

#define UART_PSOC_CTRL_HD_SEND               (uint8)(0x01u << UART_PSOC_CTRL_HD_SEND_SHIFT)
#define UART_PSOC_CTRL_HD_SEND_BREAK         (uint8)(0x01u << UART_PSOC_CTRL_HD_SEND_BREAK_SHIFT)
#define UART_PSOC_CTRL_MARK                  (uint8)(0x01u << UART_PSOC_CTRL_MARK_SHIFT)
#define UART_PSOC_CTRL_PARITY_TYPE_MASK      (uint8)(0x03u << UART_PSOC_CTRL_PARITY_TYPE0_SHIFT)
#define UART_PSOC_CTRL_RXADDR_MODE_MASK      (uint8)(0x07u << UART_PSOC_CTRL_RXADDR_MODE0_SHIFT)

/* StatusI Register Interrupt Enable Control Bits. As defined by the Register map for the AUX Control Register */
#define UART_PSOC_INT_ENABLE                         (0x10u)

/* Bit Counter (7-bit) Control Register Bit Definitions. As defined by the Register map for the AUX Control Register */
#define UART_PSOC_CNTR_ENABLE                        (0x20u)

/*   Constants for SendBreak() "retMode" parameter  */
#define UART_PSOC_SEND_BREAK                         (0x00u)
#define UART_PSOC_WAIT_FOR_COMPLETE_REINIT           (0x01u)
#define UART_PSOC_REINIT                             (0x02u)
#define UART_PSOC_SEND_WAIT_REINIT                   (0x03u)

#define UART_PSOC_OVER_SAMPLE_8                      (8u)
#define UART_PSOC_OVER_SAMPLE_16                     (16u)

#define UART_PSOC_BIT_CENTER                         (UART_PSOC_OVER_SAMPLE_COUNT - 2u)

#define UART_PSOC_FIFO_LENGTH                        (4u)
#define UART_PSOC_NUMBER_OF_START_BIT                (1u)
#define UART_PSOC_MAX_BYTE_VALUE                     (0xFFu)

/* 8X always for count7 implementation */
#define UART_PSOC_TXBITCTR_BREAKBITS8X   ((UART_PSOC_BREAK_BITS_TX * UART_PSOC_OVER_SAMPLE_8) - 1u)
/* 8X or 16X for DP implementation */
#define UART_PSOC_TXBITCTR_BREAKBITS ((UART_PSOC_BREAK_BITS_TX * UART_PSOC_OVER_SAMPLE_COUNT) - 1u)

#define UART_PSOC_HALF_BIT_COUNT   \
                            (((UART_PSOC_OVER_SAMPLE_COUNT / 2u) + (UART_PSOC_USE23POLLING * 1u)) - 2u)
#if (UART_PSOC_OVER_SAMPLE_COUNT == UART_PSOC_OVER_SAMPLE_8)
    #define UART_PSOC_HD_TXBITCTR_INIT   (((UART_PSOC_BREAK_BITS_TX + \
                            UART_PSOC_NUMBER_OF_START_BIT) * UART_PSOC_OVER_SAMPLE_COUNT) - 1u)

    /* This parameter is increased on the 2 in 2 out of 3 mode to sample voting in the middle */
    #define UART_PSOC_RXBITCTR_INIT  ((((UART_PSOC_BREAK_BITS_RX + UART_PSOC_NUMBER_OF_START_BIT) \
                            * UART_PSOC_OVER_SAMPLE_COUNT) + UART_PSOC_HALF_BIT_COUNT) - 1u)

