Voghy/Micro1_Sist_hidro_Vert/ADC_SensordeAgua/Agua.cydsn/Generated_Source/PSoC5/UART_PSOC.h
#else /* UART_PSOC_OVER_SAMPLE_COUNT == UART_PSOC_OVER_SAMPLE_16 */
    #define UART_PSOC_HD_TXBITCTR_INIT   ((8u * UART_PSOC_OVER_SAMPLE_COUNT) - 1u)
    /* 7bit counter need one more bit for OverSampleCount = 16 */
    #define UART_PSOC_RXBITCTR_INIT      (((7u * UART_PSOC_OVER_SAMPLE_COUNT) - 1u) + \
                                                      UART_PSOC_HALF_BIT_COUNT)
#endif /* End UART_PSOC_OVER_SAMPLE_COUNT */

#define UART_PSOC_HD_RXBITCTR_INIT                   UART_PSOC_RXBITCTR_INIT


/***************************************
* Global variables external identifier
***************************************/

extern uint8 UART_PSOC_initVar;
#if (UART_PSOC_TX_INTERRUPT_ENABLED && UART_PSOC_TX_ENABLED)
    extern volatile uint8 UART_PSOC_txBuffer[UART_PSOC_TX_BUFFER_SIZE];
    extern volatile uint8 UART_PSOC_txBufferRead;
    extern uint8 UART_PSOC_txBufferWrite;
#endif /* (UART_PSOC_TX_INTERRUPT_ENABLED && UART_PSOC_TX_ENABLED) */
#if (UART_PSOC_RX_INTERRUPT_ENABLED && (UART_PSOC_RX_ENABLED || UART_PSOC_HD_ENABLED))
    extern uint8 UART_PSOC_errorStatus;
    extern volatile uint8 UART_PSOC_rxBuffer[UART_PSOC_RX_BUFFER_SIZE];
    extern volatile uint8 UART_PSOC_rxBufferRead;
    extern volatile uint8 UART_PSOC_rxBufferWrite;
    extern volatile uint8 UART_PSOC_rxBufferLoopDetect;
    extern volatile uint8 UART_PSOC_rxBufferOverflow;
    #if (UART_PSOC_RXHW_ADDRESS_ENABLED)
        extern volatile uint8 UART_PSOC_rxAddressMode;
        extern volatile uint8 UART_PSOC_rxAddressDetected;
    #endif /* (UART_PSOC_RXHW_ADDRESS_ENABLED) */
#endif /* (UART_PSOC_RX_INTERRUPT_ENABLED && (UART_PSOC_RX_ENABLED || UART_PSOC_HD_ENABLED)) */


/***************************************
* Enumerated Types and Parameters
***************************************/

#define UART_PSOC__B_UART__AM_SW_BYTE_BYTE 1
#define UART_PSOC__B_UART__AM_SW_DETECT_TO_BUFFER 2
#define UART_PSOC__B_UART__AM_HW_BYTE_BY_BYTE 3
#define UART_PSOC__B_UART__AM_HW_DETECT_TO_BUFFER 4
#define UART_PSOC__B_UART__AM_NONE 0

#define UART_PSOC__B_UART__NONE_REVB 0
#define UART_PSOC__B_UART__EVEN_REVB 1
#define UART_PSOC__B_UART__ODD_REVB 2
#define UART_PSOC__B_UART__MARK_SPACE_REVB 3



/***************************************
*    Initial Parameter Constants
***************************************/

/* UART shifts max 8 bits, Mark/Space functionality working if 9 selected */
#define UART_PSOC_NUMBER_OF_DATA_BITS    ((8u > 8u) ? 8u : 8u)
#define UART_PSOC_NUMBER_OF_STOP_BITS    (1u)

#if (UART_PSOC_RXHW_ADDRESS_ENABLED)
    #define UART_PSOC_RX_ADDRESS_MODE    (0u)
    #define UART_PSOC_RX_HW_ADDRESS1     (0u)
    #define UART_PSOC_RX_HW_ADDRESS2     (0u)
#endif /* (UART_PSOC_RXHW_ADDRESS_ENABLED) */

#define UART_PSOC_INIT_RX_INTERRUPTS_MASK \
                                  (uint8)((1 << UART_PSOC_RX_STS_FIFO_NOTEMPTY_SHIFT) \
                                        | (0 << UART_PSOC_RX_STS_MRKSPC_SHIFT) \
                                        | (0 << UART_PSOC_RX_STS_ADDR_MATCH_SHIFT) \
                                        | (0 << UART_PSOC_RX_STS_PAR_ERROR_SHIFT) \
                                        | (0 << UART_PSOC_RX_STS_STOP_ERROR_SHIFT) \
                                        | (0 << UART_PSOC_RX_STS_BREAK_SHIFT) \
                                        | (0 << UART_PSOC_RX_STS_OVERRUN_SHIFT))

#define UART_PSOC_INIT_TX_INTERRUPTS_MASK \
                                  (uint8)((0 << UART_PSOC_TX_STS_COMPLETE_SHIFT) \
                                        | (0 << UART_PSOC_TX_STS_FIFO_EMPTY_SHIFT) \
                                        | (0 << UART_PSOC_TX_STS_FIFO_FULL_SHIFT) \
                                        | (0 << UART_PSOC_TX_STS_FIFO_NOT_FULL_SHIFT))


/***************************************
*              Registers
***************************************/

#ifdef UART_PSOC_BUART_sCR_SyncCtl_CtrlReg__CONTROL_REG
    #define UART_PSOC_CONTROL_REG \
                            (* (reg8 *) UART_PSOC_BUART_sCR_SyncCtl_CtrlReg__CONTROL_REG )
    #define UART_PSOC_CONTROL_PTR \
                            (  (reg8 *) UART_PSOC_BUART_sCR_SyncCtl_CtrlReg__CONTROL_REG )
#endif /* End UART_PSOC_BUART_sCR_SyncCtl_CtrlReg__CONTROL_REG */

#if(UART_PSOC_TX_ENABLED)
    #define UART_PSOC_TXDATA_REG          (* (reg8 *) UART_PSOC_BUART_sTX_TxShifter_u0__F0_REG)
    #define UART_PSOC_TXDATA_PTR          (  (reg8 *) UART_PSOC_BUART_sTX_TxShifter_u0__F0_REG)
    #define UART_PSOC_TXDATA_AUX_CTL_REG  (* (reg8 *) UART_PSOC_BUART_sTX_TxShifter_u0__DP_AUX_CTL_REG)
    #define UART_PSOC_TXDATA_AUX_CTL_PTR  (  (reg8 *) UART_PSOC_BUART_sTX_TxShifter_u0__DP_AUX_CTL_REG)
    #define UART_PSOC_TXSTATUS_REG        (* (reg8 *) UART_PSOC_BUART_sTX_TxSts__STATUS_REG)
    #define UART_PSOC_TXSTATUS_PTR        (  (reg8 *) UART_PSOC_BUART_sTX_TxSts__STATUS_REG)
    #define UART_PSOC_TXSTATUS_MASK_REG   (* (reg8 *) UART_PSOC_BUART_sTX_TxSts__MASK_REG)
    #define UART_PSOC_TXSTATUS_MASK_PTR   (  (reg8 *) UART_PSOC_BUART_sTX_TxSts__MASK_REG)
    #define UART_PSOC_TXSTATUS_ACTL_REG   (* (reg8 *) UART_PSOC_BUART_sTX_TxSts__STATUS_AUX_CTL_REG)
    #define UART_PSOC_TXSTATUS_ACTL_PTR   (  (reg8 *) UART_PSOC_BUART_sTX_TxSts__STATUS_AUX_CTL_REG)

    /* DP clock */
    #if(UART_PSOC_TXCLKGEN_DP)
        #define UART_PSOC_TXBITCLKGEN_CTR_REG        \
                                        (* (reg8 *) UART_PSOC_BUART_sTX_sCLOCK_TxBitClkGen__D0_REG)
        #define UART_PSOC_TXBITCLKGEN_CTR_PTR        \
                                        (  (reg8 *) UART_PSOC_BUART_sTX_sCLOCK_TxBitClkGen__D0_REG)
        #define UART_PSOC_TXBITCLKTX_COMPLETE_REG    \
                                        (* (reg8 *) UART_PSOC_BUART_sTX_sCLOCK_TxBitClkGen__D1_REG)
        #define UART_PSOC_TXBITCLKTX_COMPLETE_PTR    \
                                        (  (reg8 *) UART_PSOC_BUART_sTX_sCLOCK_TxBitClkGen__D1_REG)
    #else     /* Count7 clock*/
        #define UART_PSOC_TXBITCTR_PERIOD_REG    \
                                        (* (reg8 *) UART_PSOC_BUART_sTX_sCLOCK_TxBitCounter__PERIOD_REG)
        #define UART_PSOC_TXBITCTR_PERIOD_PTR    \
                                        (  (reg8 *) UART_PSOC_BUART_sTX_sCLOCK_TxBitCounter__PERIOD_REG)
        #define UART_PSOC_TXBITCTR_CONTROL_REG   \
                                        (* (reg8 *) UART_PSOC_BUART_sTX_sCLOCK_TxBitCounter__CONTROL_AUX_CTL_REG)
        #define UART_PSOC_TXBITCTR_CONTROL_PTR   \
                                        (  (reg8 *) UART_PSOC_BUART_sTX_sCLOCK_TxBitCounter__CONTROL_AUX_CTL_REG)
        #define UART_PSOC_TXBITCTR_COUNTER_REG   \
                                        (* (reg8 *) UART_PSOC_BUART_sTX_sCLOCK_TxBitCounter__COUNT_REG)
        #define UART_PSOC_TXBITCTR_COUNTER_PTR   \
                                        (  (reg8 *) UART_PSOC_BUART_sTX_sCLOCK_TxBitCounter__COUNT_REG)
    #endif /* UART_PSOC_TXCLKGEN_DP */

#endif /* End UART_PSOC_TX_ENABLED */

#if(UART_PSOC_HD_ENABLED)

