Voghy/Micro1_Sist_hidro_Vert/ADC_SensordeAgua/Agua.cydsn/Generated_Source/PSoC5/UART_PSOC.h
    #define UART_PSOC_TXDATA_REG             (* (reg8 *) UART_PSOC_BUART_sRX_RxShifter_u0__F1_REG )
    #define UART_PSOC_TXDATA_PTR             (  (reg8 *) UART_PSOC_BUART_sRX_RxShifter_u0__F1_REG )
    #define UART_PSOC_TXDATA_AUX_CTL_REG     (* (reg8 *) UART_PSOC_BUART_sRX_RxShifter_u0__DP_AUX_CTL_REG)
    #define UART_PSOC_TXDATA_AUX_CTL_PTR     (  (reg8 *) UART_PSOC_BUART_sRX_RxShifter_u0__DP_AUX_CTL_REG)

    #define UART_PSOC_TXSTATUS_REG           (* (reg8 *) UART_PSOC_BUART_sRX_RxSts__STATUS_REG )
    #define UART_PSOC_TXSTATUS_PTR           (  (reg8 *) UART_PSOC_BUART_sRX_RxSts__STATUS_REG )
    #define UART_PSOC_TXSTATUS_MASK_REG      (* (reg8 *) UART_PSOC_BUART_sRX_RxSts__MASK_REG )
    #define UART_PSOC_TXSTATUS_MASK_PTR      (  (reg8 *) UART_PSOC_BUART_sRX_RxSts__MASK_REG )
    #define UART_PSOC_TXSTATUS_ACTL_REG      (* (reg8 *) UART_PSOC_BUART_sRX_RxSts__STATUS_AUX_CTL_REG )
    #define UART_PSOC_TXSTATUS_ACTL_PTR      (  (reg8 *) UART_PSOC_BUART_sRX_RxSts__STATUS_AUX_CTL_REG )
#endif /* End UART_PSOC_HD_ENABLED */

#if( (UART_PSOC_RX_ENABLED) || (UART_PSOC_HD_ENABLED) )
    #define UART_PSOC_RXDATA_REG             (* (reg8 *) UART_PSOC_BUART_sRX_RxShifter_u0__F0_REG )
    #define UART_PSOC_RXDATA_PTR             (  (reg8 *) UART_PSOC_BUART_sRX_RxShifter_u0__F0_REG )
    #define UART_PSOC_RXADDRESS1_REG         (* (reg8 *) UART_PSOC_BUART_sRX_RxShifter_u0__D0_REG )
    #define UART_PSOC_RXADDRESS1_PTR         (  (reg8 *) UART_PSOC_BUART_sRX_RxShifter_u0__D0_REG )
    #define UART_PSOC_RXADDRESS2_REG         (* (reg8 *) UART_PSOC_BUART_sRX_RxShifter_u0__D1_REG )
    #define UART_PSOC_RXADDRESS2_PTR         (  (reg8 *) UART_PSOC_BUART_sRX_RxShifter_u0__D1_REG )
    #define UART_PSOC_RXDATA_AUX_CTL_REG     (* (reg8 *) UART_PSOC_BUART_sRX_RxShifter_u0__DP_AUX_CTL_REG)

    #define UART_PSOC_RXBITCTR_PERIOD_REG    (* (reg8 *) UART_PSOC_BUART_sRX_RxBitCounter__PERIOD_REG )
    #define UART_PSOC_RXBITCTR_PERIOD_PTR    (  (reg8 *) UART_PSOC_BUART_sRX_RxBitCounter__PERIOD_REG )
    #define UART_PSOC_RXBITCTR_CONTROL_REG   \
                                        (* (reg8 *) UART_PSOC_BUART_sRX_RxBitCounter__CONTROL_AUX_CTL_REG )
    #define UART_PSOC_RXBITCTR_CONTROL_PTR   \
                                        (  (reg8 *) UART_PSOC_BUART_sRX_RxBitCounter__CONTROL_AUX_CTL_REG )
    #define UART_PSOC_RXBITCTR_COUNTER_REG   (* (reg8 *) UART_PSOC_BUART_sRX_RxBitCounter__COUNT_REG )
    #define UART_PSOC_RXBITCTR_COUNTER_PTR   (  (reg8 *) UART_PSOC_BUART_sRX_RxBitCounter__COUNT_REG )

    #define UART_PSOC_RXSTATUS_REG           (* (reg8 *) UART_PSOC_BUART_sRX_RxSts__STATUS_REG )
    #define UART_PSOC_RXSTATUS_PTR           (  (reg8 *) UART_PSOC_BUART_sRX_RxSts__STATUS_REG )
    #define UART_PSOC_RXSTATUS_MASK_REG      (* (reg8 *) UART_PSOC_BUART_sRX_RxSts__MASK_REG )
    #define UART_PSOC_RXSTATUS_MASK_PTR      (  (reg8 *) UART_PSOC_BUART_sRX_RxSts__MASK_REG )
    #define UART_PSOC_RXSTATUS_ACTL_REG      (* (reg8 *) UART_PSOC_BUART_sRX_RxSts__STATUS_AUX_CTL_REG )
    #define UART_PSOC_RXSTATUS_ACTL_PTR      (  (reg8 *) UART_PSOC_BUART_sRX_RxSts__STATUS_AUX_CTL_REG )
#endif /* End  (UART_PSOC_RX_ENABLED) || (UART_PSOC_HD_ENABLED) */

#if(UART_PSOC_INTERNAL_CLOCK_USED)
    /* Register to enable or disable the digital clocks */
    #define UART_PSOC_INTCLOCK_CLKEN_REG     (* (reg8 *) UART_PSOC_IntClock__PM_ACT_CFG)
    #define UART_PSOC_INTCLOCK_CLKEN_PTR     (  (reg8 *) UART_PSOC_IntClock__PM_ACT_CFG)

    /* Clock mask for this clock. */
    #define UART_PSOC_INTCLOCK_CLKEN_MASK    UART_PSOC_IntClock__PM_ACT_MSK
#endif /* End UART_PSOC_INTERNAL_CLOCK_USED */


/***************************************
*       Register Constants
***************************************/

#if(UART_PSOC_TX_ENABLED)
    #define UART_PSOC_TX_FIFO_CLR            (0x01u) /* FIFO0 CLR */
#endif /* End UART_PSOC_TX_ENABLED */

#if(UART_PSOC_HD_ENABLED)
    #define UART_PSOC_TX_FIFO_CLR            (0x02u) /* FIFO1 CLR */
#endif /* End UART_PSOC_HD_ENABLED */

#if( (UART_PSOC_RX_ENABLED) || (UART_PSOC_HD_ENABLED) )
    #define UART_PSOC_RX_FIFO_CLR            (0x01u) /* FIFO0 CLR */
#endif /* End  (UART_PSOC_RX_ENABLED) || (UART_PSOC_HD_ENABLED) */


/***************************************
* The following code is DEPRECATED and
* should not be used in new projects.
***************************************/

/* UART v2_40 obsolete definitions */
#define UART_PSOC_WAIT_1_MS      UART_PSOC_BL_CHK_DELAY_MS   

#define UART_PSOC_TXBUFFERSIZE   UART_PSOC_TX_BUFFER_SIZE
#define UART_PSOC_RXBUFFERSIZE   UART_PSOC_RX_BUFFER_SIZE

#if (UART_PSOC_RXHW_ADDRESS_ENABLED)
    #define UART_PSOC_RXADDRESSMODE  UART_PSOC_RX_ADDRESS_MODE
    #define UART_PSOC_RXHWADDRESS1   UART_PSOC_RX_HW_ADDRESS1
    #define UART_PSOC_RXHWADDRESS2   UART_PSOC_RX_HW_ADDRESS2
    /* Backward compatible define */
    #define UART_PSOC_RXAddressMode  UART_PSOC_RXADDRESSMODE
#endif /* (UART_PSOC_RXHW_ADDRESS_ENABLED) */

/* UART v2_30 obsolete definitions */
#define UART_PSOC_initvar                    UART_PSOC_initVar

#define UART_PSOC_RX_Enabled                 UART_PSOC_RX_ENABLED
#define UART_PSOC_TX_Enabled                 UART_PSOC_TX_ENABLED
#define UART_PSOC_HD_Enabled                 UART_PSOC_HD_ENABLED
#define UART_PSOC_RX_IntInterruptEnabled     UART_PSOC_RX_INTERRUPT_ENABLED
#define UART_PSOC_TX_IntInterruptEnabled     UART_PSOC_TX_INTERRUPT_ENABLED
#define UART_PSOC_InternalClockUsed          UART_PSOC_INTERNAL_CLOCK_USED
#define UART_PSOC_RXHW_Address_Enabled       UART_PSOC_RXHW_ADDRESS_ENABLED
#define UART_PSOC_OverSampleCount            UART_PSOC_OVER_SAMPLE_COUNT
#define UART_PSOC_ParityType                 UART_PSOC_PARITY_TYPE

#if( UART_PSOC_TX_ENABLED && (UART_PSOC_TXBUFFERSIZE > UART_PSOC_FIFO_LENGTH))
    #define UART_PSOC_TXBUFFER               UART_PSOC_txBuffer
    #define UART_PSOC_TXBUFFERREAD           UART_PSOC_txBufferRead
    #define UART_PSOC_TXBUFFERWRITE          UART_PSOC_txBufferWrite
#endif /* End UART_PSOC_TX_ENABLED */
#if( ( UART_PSOC_RX_ENABLED || UART_PSOC_HD_ENABLED ) && \
     (UART_PSOC_RXBUFFERSIZE > UART_PSOC_FIFO_LENGTH) )
    #define UART_PSOC_RXBUFFER               UART_PSOC_rxBuffer
    #define UART_PSOC_RXBUFFERREAD           UART_PSOC_rxBufferRead
    #define UART_PSOC_RXBUFFERWRITE          UART_PSOC_rxBufferWrite
    #define UART_PSOC_RXBUFFERLOOPDETECT     UART_PSOC_rxBufferLoopDetect
    #define UART_PSOC_RXBUFFER_OVERFLOW      UART_PSOC_rxBufferOverflow
#endif /* End UART_PSOC_RX_ENABLED */

#ifdef UART_PSOC_BUART_sCR_SyncCtl_CtrlReg__CONTROL_REG
    #define UART_PSOC_CONTROL                UART_PSOC_CONTROL_REG
#endif /* End UART_PSOC_BUART_sCR_SyncCtl_CtrlReg__CONTROL_REG */

#if(UART_PSOC_TX_ENABLED)
    #define UART_PSOC_TXDATA                 UART_PSOC_TXDATA_REG
    #define UART_PSOC_TXSTATUS               UART_PSOC_TXSTATUS_REG
    #define UART_PSOC_TXSTATUS_MASK          UART_PSOC_TXSTATUS_MASK_REG
    #define UART_PSOC_TXSTATUS_ACTL          UART_PSOC_TXSTATUS_ACTL_REG
    /* DP clock */
    #if(UART_PSOC_TXCLKGEN_DP)
        #define UART_PSOC_TXBITCLKGEN_CTR        UART_PSOC_TXBITCLKGEN_CTR_REG
        #define UART_PSOC_TXBITCLKTX_COMPLETE    UART_PSOC_TXBITCLKTX_COMPLETE_REG
    #else     /* Count7 clock*/
        #define UART_PSOC_TXBITCTR_PERIOD        UART_PSOC_TXBITCTR_PERIOD_REG
        #define UART_PSOC_TXBITCTR_CONTROL       UART_PSOC_TXBITCTR_CONTROL_REG
        #define UART_PSOC_TXBITCTR_COUNTER       UART_PSOC_TXBITCTR_COUNTER_REG
    #endif /* UART_PSOC_TXCLKGEN_DP */
#endif /* End UART_PSOC_TX_ENABLED */

#if(UART_PSOC_HD_ENABLED)
    #define UART_PSOC_TXDATA                 UART_PSOC_TXDATA_REG
    #define UART_PSOC_TXSTATUS               UART_PSOC_TXSTATUS_REG
    #define UART_PSOC_TXSTATUS_MASK          UART_PSOC_TXSTATUS_MASK_REG
    #define UART_PSOC_TXSTATUS_ACTL          UART_PSOC_TXSTATUS_ACTL_REG
#endif /* End UART_PSOC_HD_ENABLED */

#if( (UART_PSOC_RX_ENABLED) || (UART_PSOC_HD_ENABLED) )
    #define UART_PSOC_RXDATA                 UART_PSOC_RXDATA_REG
    #define UART_PSOC_RXADDRESS1             UART_PSOC_RXADDRESS1_REG
    #define UART_PSOC_RXADDRESS2             UART_PSOC_RXADDRESS2_REG
    #define UART_PSOC_RXBITCTR_PERIOD        UART_PSOC_RXBITCTR_PERIOD_REG
    #define UART_PSOC_RXBITCTR_CONTROL       UART_PSOC_RXBITCTR_CONTROL_REG
    #define UART_PSOC_RXBITCTR_COUNTER       UART_PSOC_RXBITCTR_COUNTER_REG
    #define UART_PSOC_RXSTATUS               UART_PSOC_RXSTATUS_REG
    #define UART_PSOC_RXSTATUS_MASK          UART_PSOC_RXSTATUS_MASK_REG
    #define UART_PSOC_RXSTATUS_ACTL          UART_PSOC_RXSTATUS_ACTL_REG
#endif /* End  (UART_PSOC_RX_ENABLED) || (UART_PSOC_HD_ENABLED) */

#if(UART_PSOC_INTERNAL_CLOCK_USED)
    #define UART_PSOC_INTCLOCK_CLKEN         UART_PSOC_INTCLOCK_CLKEN_REG
#endif /* End UART_PSOC_INTERNAL_CLOCK_USED */

#define UART_PSOC_WAIT_FOR_COMLETE_REINIT    UART_PSOC_WAIT_FOR_COMPLETE_REINIT

#endif  /* CY_UART_UART_PSOC_H */


/* [] END OF FILE */
